CSI API ETABS v1
cOAPI.UnsetAsActiveObject Method
 This function removes the ETABSObject instance from the system Running Object Table (ROT).
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int UnsetAsActiveObject()
Function UnsetAsActiveObject As Integer
Dim instance As cOAPI
Dim returnValue As Integer
returnValue = instance.UnsetAsActiveObject()
int UnsetAsActiveObject()
abstract UnsetAsActiveObject : unit -> int
Return Value
Type: Int32
This function returns zero if the current instance is successfully removed from the ROT and nonzero if it fails or if the current instance is not in the ROT.
Remarks
Examples
Public Sub Example()
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'set as active instance
       ret = EtabsObject.UnsetAsActiveObject
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       EtabsObject = Nothing
   End Sub
See Also
Reference
cOAPI Interface
ETABSv1 Namespace